//Проверяйте, что scanf прочитал ровно два значения, если это неверно, выводите описание ошибки на stderr и завершайтесь с ненулевым кодом ошибки
//Упростите логическое выражение до не больше чем одного if
//Объявите вещественные константы следующим образом static const double LEFT = 2.0; или целочисленные константы следующим образом enum { LEFT = 2 };

#include <stdio.h>

int
main()
{
    double x, y;
    scanf("%lf %lf", &x, &y);

    if (y >= 1 && y <= 7 && x >= 2 && x <= 3) {
        printf("%d\n", 1);
    } else if (y >= 3 && y <= 7 && x >= 3 && x <= 5) {
        printf("%d\n", 1);
    } else if (y >= 1 && y <= 3 && x >= 3 && x <= 5 && (x - 2 <= y)) {
        printf("%d\n", 1);
    } else {
        printf("%d\n", 0);
    }

    return 0;
}
